music_app/app/models/user.rb

  def self.find_by_credentials(attempted_email, attempted_password)
    user = User.find_by(email: attempted_email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "sfoejngk@gmail.com"], ["LIMIT", 1]]

  def reset_session_token!
    self.update!(session_token: User::generate_session_token)
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "kzRz9vvmTXhdf_rss2oGZQ"], ["updated_at", "2018-10-18 17:17:54.728997"], ["id", 8]]