music_app/app/controllers/bands_controller.rb

  def create
    @band = Band.new(band_params)

    if @band.save
---
INSERT INTO "bands" ("name", "created_at", "updated_at", "image") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "yej"], ["created_at", "2018-10-18 20:07:36.412728"], ["updated_at", "2018-10-18 20:07:36.412728"], ["image", "eyjej"]]