music_app/app/views/bands/index.html.erb

SELECT "bands".* FROM "bands"
---
<div class="band_pictures">
  <% Band.all.each do |band| %>